MMBytes/MultiGeiger-V2/sdkconfig.defaults
# Target: Heltec Wireless Stick V2 (ESP32 rev1)
CONFIG_IDF_TARGET="esp32"

# Auto-detect XTAL — Heltec V2 modules may be 26 MHz (arduino-esp32 default is AUTO).
# Hardcoding 40 MHz here produced garbled UART (~177 kbaud actual at 115200 nominal).
CONFIG_XTAL_FREQ_AUTO=y

# 8 MB flash on Heltec V2
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# Custom partition table (factory + dual OTA, 2 MB each). See partitions.csv.
# Default singleapp 1 MB was at 4% free with only M1/M6/M7 integrated.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set

# Note: CONFIG_LWIP_DHCP_SET_BROADCAST_FLAG existed in IDF 5.x; removed in 6.0.
# lwIP's dhcp.c now hard-codes "no broadcast flag" (comment: "we don't need the
# broadcast flag since we can receive unicast traffic before being fully
# configured"). On our AP this is fine — spike measured 1.1 s DHCP without it.

# Keep CONFIG_LWIP_DHCP_RESTORE_LAST_IP default (y) — REBOOTING fast path on 2nd+ boot.

# DHCP debug off for overnight soak (was filling log at ~10 KB/s).
# CONFIG_LWIP_DEBUG is not set
# CONFIG_LWIP_DHCP_DEBUG is not set

# Log level: INFO by default, can bump to DEBUG via menuconfig if needed
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# Wall-clock timestamp prefix on every log line (YY-MM-DD HH:MM:SS.sss).
# Pre-NTP: reads from RTC (starts at epoch 1970). Post-NTP: real Sydney local time.
# SYSTEM_FULL depends on LOG_VERSION_2 — default is V1 (ms since boot).
CONFIG_LOG_VERSION_2=y
CONFIG_LOG_TIMESTAMP_SOURCE_SYSTEM_FULL=y
# CONFIG_LOG_TIMESTAMP_SOURCE_RTOS is not set

# Bigger TCPIP task stack — we flagged 2560 as too small
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=4096

# Bump main task stack 3584 -> 8192. V2.0.24 hit a "task main" stack overflow
# after ~60 min with display code + router-restart reconnect storms; display's
# clear helpers now use static buffers, and this extra headroom is insurance
# against deeper event-driven call chains on the main task.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# TX worker blocks on TLS for seconds at a time; that legitimately starves IDLE
# on its CPU. Stop the task watchdog from monitoring both IDLE tasks — the wdt
# is still armed for every other named task (main, tx, tcpip, wifi), so a real
# hang in one of those still fires.
# CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0 is not set
# CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1 is not set

# Enable gratuitous ARP after GOT_IP (default is on anyway, but be explicit)
CONFIG_LWIP_ESP_GRATUITOUS_ARP=y

# Mozilla CA bundle baked into firmware flash for esp_crt_bundle_attach() (M6 HTTPS TX).
# Parent symbol is default=y in IDF 6.0; full-bundle sub-choice is the default when on.
# (IDF 5.x: CONFIG_MBEDTLS_DEFAULT_CERTIFICATE_BUNDLE_FULL → IDF 6.0: _BUNDLE_DEFAULT_FULL.)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# OTA stability tweaks (lesson from V1.18.60): yield to TCPIP task during flash
# erase so the browser's upload XHR doesn't stall and drop with status 0.
CONFIG_SPI_FLASH_YIELD_DURING_ERASE=y
CONFIG_LWIP_TCP_WND_DEFAULT=16384

# Bigger sys_evt stack (default 2304). Headroom for occasional verbose driver
# logs through the applog vprintf hook (1 KB line buffer) plus deeper event
# call chains. Costs ~4 KB DRAM.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=6144
